In [1]:
import numpy as np
import pandas as pd

In [2]:
obj=pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [3]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [4]:
obj2=obj.reindex(['a','b','c','d','e'])

In [5]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [6]:
obj3=pd.Series(['blue','purple','yellow'],index=[0,2,4])

In [7]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [8]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [9]:
frame=pd.DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],columns=['Ohio','Texas','California'])

In [10]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [11]:
frame2=frame.reindex(['a','b','c','d'])

In [12]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [13]:
states=['Texas','Utah','California']

In [14]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [15]:
obj=pd.Series(np.arange(5.),index=['a','b','c','d','e'])

In [16]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [17]:
new_obj=obj.drop('c')

In [18]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [19]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [20]:
data=pd.DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','CC','DD','EE'],columns=['one','two','three','four'])

In [21]:
data

      one  two  three  four
Ohio    0    1      2     3
CC      4    5      6     7
DD      8    9     10    11
EE     12   13     14    15

In [22]:
data.drop(['CC','DD'])

      one  two  three  four
Ohio    0    1      2     3
EE     12   13     14    15

In [29]:
data.drop('three',axis=1)

      one  two  four
Ohio    0    1     3
CC      4    5     7
DD      8    9    11
EE     12   13    15

In [30]:
data.drop(['two','four'],axis='columns')

      one  three
Ohio    0      2
CC      4      6
DD      8     10
EE     12     14

In [31]:
obj=pd.Series(np.arange(4.),index=['a','b','c','d'])

In [32]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [33]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [34]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [35]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int64

In [36]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [37]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [38]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    4    5
Utah        11    8    9

In [39]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [40]:
data.iloc[:,:3][data.three>5]

          one  two  three
Colorado    4    5      6
Utah        8    9     10
New York   12   13     14

In [41]:
ser=pd.Series(np.arange(3.))

In [42]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [44]:
ser2=pd.Series(np.arange(3.),index=['a','b','c'])

In [45]:
ser2[-1]

2.0

In [46]:
ser2

a    0.0
b    1.0
c    2.0
dtype: float64

In [47]:
ser[:1]

0    0.0
dtype: float64

In [48]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [49]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],index=['a', 'c', 'e', 'f', 'g'])

In [50]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64